# Delete Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAggregate..::..Delete Method
IFCAggregate Class See Also
---
Delete the aggregate object from the IFCFile model.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void Delete()
```

Visual Basic
---
```text
Public Sub Delete
```

Visual C++
---
```text
public:
void Delete()
```

# See Also
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace